In [1]:
import pandas as pd
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

##### 1. reset Index

In [4]:

ser.reset_index().head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

##### 2. Merge two Series

In [8]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
# Changing Series Name
ser1.name = "alphabet"
ser2 = pd.Series(np.arange(1,27))
ser2.name = "id"
ser = pd.concat([ser1,ser2],axis = 1)
ser.head()

  alphabet  id
0        a   1
1        b   2
2        c   3
3        e   4
4        d   5

##### 3. Filtering Series

In [83]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

ser1[~ser1.isin(ser2)]
# np.intersect1d(ser1, ser2)

0    1
1    2
2    3
3    4
4    5
dtype: int64

##### 4. Filtering DataFrame based on column values

In [82]:
ser1 = pd.DataFrame([[1, 2, 3, 4, 5],['a','b','c']]).transpose()
ser1.columns = ["col1","col2"]
ser2 = pd.DataFrame([ 5, 6, 7, 8],columns=["col2"])
ser1[~ser1.col1.isin(ser2.col2)]
# np.intersect1d(ser1, ser2)

  col1 col2
0    1    a
1    2    b
2    3    c
3  4.0  NaN

#### 5. {A - B} U {B - A}

In [30]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

pd.concat([ser1[~ser1.isin(ser2)], ser2[~ser2.isin(ser1)]])

0    1
1    2
2    3
2    6
3    7
4    8
dtype: int64

##### 6. Quartiles

In [32]:
state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))

# Solution
np.percentile(ser, q=[0, 25, 50, 75, 100])

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403, 18.0949083 ])

##### 7. Value Counts

In [35]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser.value_counts()

h    6
d    5
e    4
b    4
f    4
g    3
a    3
c    1
Name: count, dtype: int64

##### 8. Get Top 2 count results and keep everything else as Other

In [ ]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'

##### 9. Count Values

In [60]:
ser = pd.Series(np.random.random(20))

# bins are spaces between q values, labels for these spaces
pd.qcut(ser, q=[0, .10, .20, .3, .4, .5, .6, .7, .8, .9, 1],

        labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head()

0    5th
1    3rd
2    8th
3    6th
4    4th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

##### 10. Convert a numpy array to a dataframe of given shape

In [64]:
ser = pd.Series(np.random.randint(0, 9, 35))
print(len(ser))
pd.DataFrame(ser.to_numpy().reshape(7,5))

35

   0  1  2  3  4
0  8  0  5  5  1
1  0  4  8  1  5
2  8  1  5  7  1
3  8  4  0  7  7
4  4  7  6  5  3
5  7  6  4  8  6
6  2  5  3  4  2

##### 11. Find positions of numbers that are multiples of a number

In [71]:
# Indices of 3 multiples
ser = pd.Series(np.random.randint(1, 10, 7))
ser.name = "col"
ser[ser % 3 == 0].index
#np.argwhere(ser % 3==0)

Index([0, 1, 3, 5, 6], dtype='int64')

##### 12. Extract items at given positions from a series

In [72]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
ser[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

##### 13. stack two series vertically and horizontally

In [77]:
ser1 = pd.Series(range(3))
ser2 = pd.Series(list('abc'))

ser_v = pd.concat([ser1,ser2], axis = 0)
ser_h = pd.concat([ser1,ser2], axis = 1)

print(ser_v.head())
print(ser_h.head())

0    0
1    1
2    2
0    a
1    b
dtype: object
   0  1
0  0  a
1  1  b
2  2  c

##### 14. Get the positions of items of series A in another series B

In [103]:
# Get indices of ser2 elements (all of them in ser1)
# If not all present, do intersection and assign it to ser2
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])
indices = ser1.isin(ser2)
indices[indices].index.tolist()

0    True
4    True
5    True
8    True
dtype: bool

##### 15. Mean Sq Err value computation

In [98]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

np.mean((truth - pred)**2)

0.3451050075168316

##### 16. Convert first character of each element in a series to uppercase

In [105]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
ser.map(lambda x: x[0].upper() + x[1:])
# pd.Series([i.title() for i in ser])

0     How
1      To
2    Kick
3    Ass?
dtype: object

##### 17. calculate the number of characters in each word in a series

In [106]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
ser.map(lambda x: len(x))

0    3
1    2
2    4
3    4
dtype: int64

##### 18. Difference between the consequtive numbers of ser.

In [108]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

ser.diff(periods=2)

0     NaN
1     NaN
2     5.0
3     7.0
4     9.0
5    11.0
6    12.0
7    14.0
dtype: float64

##### 19. Convert a series of date-strings to a timeseries

In [114]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
# pd.to_datetime(ser,format='mixed')
pd.DatetimeIndex(ser)

DatetimeIndex(['2010-01-01 00:00:00', '2011-02-02 00:00:00',
               '2012-03-03 00:00:00', '2013-04-04 00:00:00',
               '2014-05-05 00:00:00', '2015-06-06 12:20:00'],
              dtype='datetime64[ns]', freq=None)

##### 20. Get time stats from a series of date strings
 
Day of month, week number, day of year and day of week

In [140]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
#ser = pd.to_datetime(ser,format='mixed')
ser = pd.DatetimeIndex(ser)
print("Day of Month:",ser.day.to_list())
print("Week Number in Year:",ser.isocalendar().week.to_list())
print("Day in Year:",ser.day_of_year.to_list())
print("Day of Week:",ser.day_name().to_list())

Day of Month: [1, 2, 3, 4, 5, 6]
Week Number in Year: [53, 5, 9, 14, 19, 23]
Day in Year: [1, 33, 63, 94, 125, 157]
Day of Week: ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

##### 21. Convert year-month string to dates corresponding to the 4th day of the month 
Change ser to dates that start with 4th of the respective months.

In [150]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])
dates = '04 ' + ser

# Convert the series of strings to datetime objects
dates = pd.to_datetime(dates)
dates

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

##### 22. Filter words that contain atleast 2 vowels from a series

In [165]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])
vowels_count  = ser.str.lower().str.count(r'[aeiou]')
ser[vowels_count[vowels_count > 1].index]

0     Apple
1    Orange
4     Money
dtype: object

##### 23. Filter valid emails from a series

In [181]:
import re
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

emails[emails.map(lambda x: bool(re.match(pattern, x)))]
# emails.str.findall(pattern, flags=re.IGNORECASE)

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

##### 24. Import only every nth row from a csv file to create a dataframe

In [199]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', chunksize=20)
df2 = pd.concat([chunk.iloc[0] for chunk in df], axis=1)
df2 = df2.transpose()
df2.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
20,1.25179,0.0,8.14,0.0,0.538,5.570,98.1,3.7979,4.0,307.0,21.0,376.57,21.02,13.6
40,0.03359,75.0,2.95,0.0,0.428,7.024,15.8,5.4011,3.0,252.0,18.3,395.62,1.98,34.9
60,0.14932,25.0,5.13,0.0,0.453,5.741,66.2,7.2254,8.0,284.0,19.7,395.11,13.15,18.7
80,0.04113,25.0,4.86,0.0,0.426,6.727,33.5,5.4007,4.0,281.0,19.0,396.90,5.29,28.0

In [198]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv')
df.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2